In [1]:
%load_ext sql

In [2]:
%sql sqlite:///library_activity.db

In [3]:
%%sql
SELECT * FROM sqlite_schema;

 * sqlite:///library_activity.db
Done.

[('table', 'Books', 'Books', 2, 'CREATE TABLE Books (\n    book_id INTEGER PRIMARY KEY,\n    title TEXT,\n    author TEXT,\n    genre TEXT,\n    publication_year INTEGER\n)'),
 ('table', 'Members', 'Members', 3, 'CREATE TABLE Members (\n    member_id INTEGER PRIMARY KEY,\n    first_name TEXT,\n    last_name TEXT,\n    membership_type TEXT\n)'),
 ('table', 'BorrowedBooks', 'BorrowedBooks', 4, 'CREATE TABLE BorrowedBooks (\n    borrow_id INTEGER PRIMARY KEY,\n    member_id INTEGER,\n    book_id INTEGER,\n    borrow_date DATE,\n    return_date DATE,\n    FOREIGN KEY (member_id) REFERENCES Members(member_id),\n    FOREIGN KEY (book_id) REFERENCES Books(book_id)\n)')]

In [5]:
%%sql
SELECT * FROM BorrowedBooks;

 * sqlite:///library_activity.db
Done.

[(1, 1, 2, '2023-09-01', '2023-09-10'),
 (2, 2, 4, '2023-09-05', '2023-09-15'),
 (3, 3, 1, '2023-09-07', None),
 (4, 4, 6, '2023-09-08', None),
 (5, 5, 3, '2023-09-09', '2023-09-19')]

In [4]:
%%sql
SELECT * FROM Books;

 * sqlite:///library_activity.db
Done.

[(1, '1984', 'George Orwell', 'Dystopian', 1949),
 (2, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960),
 (3, 'A Brief History of Time', 'Stephen Hawking', 'Science', 1988),
 (4, 'Dune', 'Frank Herbert', 'Science Fiction', 1965),
 (5, 'The Catcher in the Rye', 'J.D. Salinger', 'Fiction', 1951),
 (6, 'Fahrenheit 451', 'Ray Bradbury', 'Dystopian', 1953),
 (7, 'The Great Gatsby', 'F. Scott Fitzgerald', 'Fiction', 1925),
 (8, 'The War of the Worlds', 'H.G. Wells', 'Science Fiction', 1898),
 (9, 'The Martian', 'Andy Weir', 'Science Fiction', 2011),
 (10, 'The Selfish Gene', 'Richard Dawkins', 'Science', 1976)]

In [20]:
%%sql
SELECT * FROM Members;

 * sqlite:///library_activity.db
Done.

[(1, 'Alice', 'Johnson', 'Regular'),
 (2, 'Bob', 'Smith', 'Premium'),
 (3, 'Charlie', 'Davis', 'Regular'),
 (4, 'Dana', 'Lee', 'Premium'),
 (5, 'Eve', 'Martinez', 'Regular')]

In [ ]:
#Write a query to display the titles of the books along with their borrow dates.

In [8]:
%%sql
SELECT books.title, 
    BorrowedBooks.borrow_date
FROM Books
JOIN BorrowedBooks
ON Books.book_id = BorrowedBooks.book_id;

 * sqlite:///library_activity.db
Done.

[('To Kill a Mockingbird', '2023-09-01'),
 ('Dune', '2023-09-05'),
 ('1984', '2023-09-07'),
 ('Fahrenheit 451', '2023-09-08'),
 ('A Brief History of Time', '2023-09-09')]

In [ ]:
#Write a query to list all columns from the Members table along with their borrow dates

In [17]:
%%sql
SELECT Members.*,
    BorrowedBooks.borrow_date
FROM Members
JOIN BorrowedBooks
on Members.member_id = BorrowedBooks.member_id;

 * sqlite:///library_activity.db
Done.

[(1, 'Alice', 'Johnson', 'Regular', '2023-09-01'),
 (2, 'Bob', 'Smith', 'Premium', '2023-09-05'),
 (3, 'Charlie', 'Davis', 'Regular', '2023-09-07'),
 (4, 'Dana', 'Lee', 'Premium', '2023-09-08'),
 (5, 'Eve', 'Martinez', 'Regular', '2023-09-09')]

In [ ]:
#Write a query to list all columns from the Books table for books borrowed by a member with member_id = 1.

In [19]:
%%sql
SELECT books.*
FROM books
JOIN BorrowedBooks
ON books.book_id = BorrowedBooks.book_id
WHERE BorrowedBooks.member_id = 1;

 * sqlite:///library_activity.db
Done.

[(2, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960)]